app/views/api/spots/show.json.jbuilder


@spot.reviews.includes(:author).each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."spot_id" = $1  [["spot_id", 2]]